<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Description</key>
        <string>Recipe description</string>
        <key>Identifier</key>
        <string>com.github.krispayne.jss.SublimeText4</string>
        <key>Input</key>
        <dict>
          <key>NAME</key>
          <string>Sublime Text 4</string>
    			<key>CATEGORY</key>
    			<string>Editors</string>
    			<key>GROUP_NAME</key>
    			<string>autopkg-%NAME%</string>
    			<key>GROUP_TEMPLATE</key>
    			<string>SmartGroupTemplate.xml</string>
    			<key>POLICY_CATEGORY</key>
    			<string>Testing</string>
    			<key>POLICY_TEMPLATE</key>
    			<string>PolicyTemplate.xml</string>
        </dict>
        <key>MiniumumVersion</key>
        <string>1.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gregneagle.pkg.SublimeText4</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
                <key>non_core_processors</key>
                <dict/>
                <key>parent_recipes</key>
                <dict>
                        <key>com.github.gregneagle.download.SublimeText4</key>
                        <dict>
                                <key>git_hash</key>
                                <string>7b336fbbea5b521ce67d5756fc1084caf4b9df8c</string>
                                <key>path</key>
                                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.gregneagle-recipes/SublimeText/SublimeText4.download.recipe</string>
                                <key>sha256_hash</key>
                                <string>ebb9e806cf228672546f81991a8fa191494b137f03669ee4f8a6e6d8a2de133b</string>
                        </dict>
                        <key>com.github.gregneagle.pkg.SublimeText4</key>
                        <dict>
                                <key>git_hash</key>
                                <string>7b336fbbea5b521ce67d5756fc1084caf4b9df8c</string>
                                <key>path</key>
                                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.gregneagle-recipes/SublimeText/SublimeText4.pkg.recipe</string>
                                <key>sha256_hash</key>
                                <string>5308e14bf3d2f1ff6aaf99c3260f9742d5200166bc7c238b432b454035ee4b88</string>
                        </dict>
                </dict>
        </dict>
</dict>
</plist>
