<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of LogiMgr Installer and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.krispayne.pkg.LogiMgrInstaller</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>LogiMgr Installer 6.80.384</string>
		<key>BUNDLE_ID</key>
		<string>com.logitech.manager.installer</string>
		<key>NAME</key>
		<string>LogiMgr Installer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.krispayne.download.LogiMgrInstaller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/LogiMgr Installer 6.80.384.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
