<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Description</key>
        <string>Downloads the latest version of Mattermost and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.krispayne.pkg.Mattermost</string>
        <key>Input</key>
        <dict>
                <key>BUNDLE_ID</key>
                <string>Mattermost.Desktop</string>
                <key>NAME</key>
                <string>Mattermost</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.peshay.download.Mattermost</string>
        <key>Process</key>
        <array>
                <dict>
                        <key>Processor</key>
                        <string>AppPkgCreator</string>
                </dict>
        </array>
</dict>
</plist>
