<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Description</key>
        <string>Downloads the latest version of Mattermost and imports it into your JSS.</string>
        <key>Identifier</key>
        <string>com.github.krispayne.jss.Mattermost</string>
        <key>Input</key>
        <dict>
                <key>CATEGORY</key>
                <string>Communications</string>
                <key>GROUP_NAME</key>
                <string>autopkg-%NAME%</string>
                <key>GROUP_TEMPLATE</key>
                <string>SmartGroupTemplate.xml</string>
                <key>NAME</key>
                <string>Mattermost</string>
                <key>POLICY_CATEGORY</key>
                <string>Testing</string>
                <key>POLICY_TEMPLATE</key>
                <string>PolicyTemplate.xml</string>
                <key>SELF_SERVICE_DESCRIPTION</key>
                <string>Mattermost</string>
                <key>SELF_SERVICE_ICON</key>
                <string>%NAME%.png</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.krispayne.pkg.Mattermost</string>
        <key>Process</key>
        <array>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>category</key>
                                <string>%CATEGORY%</string>
                                <key>groups</key>
                                <array>
                                        <dict>
                                                <key>name</key>
                                                <string>%GROUP_NAME%</string>
                                                <key>smart</key>
                                                <true/>
                                                <key>template_path</key>
                                                <string>%GROUP_TEMPLATE%</string>
                                        </dict>
                                </array>
                                <key>policy_category</key>
                                <string>%POLICY_CATEGORY%</string>
                                <key>policy_template</key>
                                <string>%POLICY_TEMPLATE%</string>
                                <key>prod_name</key>
                                <string>%NAME%</string>
                                <key>self_service_description</key>
                                <string>%SELF_SERVICE_DESCRIPTION%</string>
                                <key>self_service_icon</key>
                                <string>%SELF_SERVICE_ICON%</string>
                        </dict>
                        <key>Processor</key>
                        <string>JSSImporter</string>
                </dict>
        </array>
</dict>
</plist>
